import React from "react";

function AboutTxt() {
  return (
    <div>
      <h4 className="leading-relaxed">
        About 다국적 기술 기업 Alibaba Group(알리바바 그룹) 의 공동 창립자인
        마윈은 알리바바 창립 전에 영어교사를 그만 두고 미국에 가서 인터넷을 접한
        뒤, 인터넷의 잠재력을 알게 되고 중국으로 돌아오자마자 친구와 함께
        웹사이트를 구축합니다
        <br />
        위와 같은 마윈 회장의 이야기는 고등학교에서 영어 기간제교사로 근무한
        경험이 있는 저에게 큰 감명을 주었습니다. 마윈 회장은 개발자보다는 CEO에
        가깝지만 영어교사출신인 저도 열정을 가지고 일하면 개발자로 성공할 수
        있겠다는 자신감이 생겼습니다 영어교사로 근무하는 동안 휴일에
        온라인강의를 들으며 코틀린으로 어플리케이션을 만들었으나 실력이 부족해서
        배포까지 하지는 못했습니다
        <br /> 컴퓨터 지식을 더 공부해야겠다고 느낀 저는 서울디지털대학교
        소프트웨어공학과에 3학년으로 편입하여 컴퓨터 구조와 C언어등의 강의를
        수강하였습니다 소프트웨어공학과 재학중일떄 대학은 방학기간에는
        학기중처럼 많은 강의를 들을 수 없고 전공이 아닌 교양강의학점도
        채워야했기 때문에 자퇴를 결심합니다
        <br /> 그 후 국비학원에 등록해서 JAVA 와 Spring을 배웠습니다 저는 화면에
        개발한 내용이 보이는 것이 좋아서 프론트엔드 개발자가 되기로 결심하였기
        떄문에 학원에 다니며 혼자 Javascript 공부를 하였습니다
        <br /> 특히, React 프레임워크를 접하면서 UI를 컴포넌트로 나누어서
        개발하는 것이 흥미롭다고 생각했으며 현재도 React를 공부하고 있습니다
      </h4>
    </div>
  );
}

export default AboutTxt;
